{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Lists feature evidence linking features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides human‑written summaries for multiple frontend files.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color tokens and theme variables with light/dark modes.",
  "frontend/index.html": "HTML entry file loading the React app and defining SEO metadata.",
  "frontend/src/App.tsx": "Renders the LandingPage component.",
  "frontend/src/components/landing/BookingSection.tsx": "Booking form generating a WhatsApp message after validating name and area.",
  "frontend/src/components/landing/CoverageSection.tsx": "Coverage text listing all supported service areas.",
  "frontend/src/components/landing/FloatingWhatsAppButton.tsx": "Fixed floating WhatsApp button linking to chat.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero banner with gradient background, tagline, and call/WhatsApp CTAs.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer with branding, call/WhatsApp buttons, and attribution.",
  "frontend/src/components/landing/LandingNav.tsx": "Sticky navigation bar with site title and smooth‑scroll booking button.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes all landing page sections including nav, hero, services, coverage, areas, booking, footer, and WhatsApp button.",
  "frontend/src/components/landing/OurWorkSection.tsx": "Empty placeholder file for a removed gallery section.",
  "frontend/src/components/landing/ServicesSection.tsx": "Displays four text‑based service cards in a responsive grid.",
  "frontend/src/components/ServiceAreasSection.tsx": "Displays 14 service areas in a responsive grid with a home‑service note.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing an authenticated or anonymous backend actor instance.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login/clear functions, and status flags using Dfinity AuthClient.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines extensive CSS variables for light/dark themes and service-area color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors mapped to CSS variables, extended animations, typography, and container settings.",
  "project_state.json": "Describes the project’s current ICP dapp scaffold, features, and UI structure for a Gujarati AC service landing site."
}