{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: color scheme update to match reference site, Font Awesome icon replacement, and layout/design structure updates across multiple frontend components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing component functionality, styling patterns (glassmorphism, orange/red theme), icon usage (Font Awesome), and translation key implementations.",
  "frontend/index.css": "Tailwind base styles defining CSS custom properties for light/dark themes using OKLCH color system with neutral grayscale values (no color saturation).",
  "frontend/index.html": "HTML entry point with SEO meta tags for water jet services in Ahmedabad areas, Google Fonts for multilingual support (Gujarati/Hindi), and structured JSON-LD data for local business schema.",
  "frontend/src/App.tsx": "Root application component wrapping LandingPage with LanguageProvider for i18n support.",
  "frontend/src/components/landing/BookingSection.tsx": "Booking form with name, service selector, and area inputs using glass-panel styling, orange focus states, and WhatsApp submission with custom green button featuring diagonal shine animation.",
  "frontend/src/components/landing/CoverageSection.tsx": "Coverage information section with FaTint and FaMapMarkerAlt icons in orange, centered content in a glass-panel with capsule styling.",
  "frontend/src/components/landing/FloatingWhatsAppButton.tsx": "Fixed-position WhatsApp contact button with pill shape, glass-cta-success styling, and translated aria-label for accessibility.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section component with animated background image, gradient overlays, floating decorative blobs, and CTA buttons for WhatsApp and phone calls. Uses glass morphism styling and supports internationalization.",
  "frontend/src/components/landing/IconBadge.tsx": "Reusable icon badge component with configurable size, variant (primary/orange), and optional sound effects on click. Supports keyboard accessibility and uses glass morphism styling.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer component displaying brand logo, service van icon, CTA buttons for phone/WhatsApp, copyright notice, and attribution link to caffeine.ai with UTM tracking.",
  "frontend/src/components/landing/LandingNav.tsx": "Sticky navigation bar with logo, brand name, language selector (English/Hindi/Gujarati), and a 'Book Now' button that smoothly scrolls to the booking section.",
  "frontend/src/components/landing/LandingPage.tsx": "Main landing page component that composes all landing sections (hero, services, sofa cleaning, water jet foam, booking, coverage, service areas, SEO phrases, our work) with navigation, footer, and floating WhatsApp button.",
  "frontend/src/components/landing/LocalSeoPhrasesSection.tsx": "SEO-focused section displaying four service phrases in a grid layout with icons, designed to improve local search visibility for AC and cleaning services.",
  "frontend/src/components/landing/OurWorkSection.tsx": "Gallery section showcasing six service images (water jet, before/after, service team, van) with error handling fallbacks displaying placeholder icons when images fail to load.",
  "frontend/src/components/landing/ServicesSection.tsx": "Services overview section displaying four main services (water jet, water jet foam, repairing, installation) in a grid with icons and descriptions.",
  "frontend/src/components/landing/SofaCleaningSection.tsx": "Dedicated section for sofa cleaning services featuring service list, pricing, four feature cards with icons, and a call-to-action button with discount messaging.",
  "frontend/src/components/landing/WaterJetFoamSection.tsx": "Two-column section highlighting water jet foam service with product image, description, four benefit cards (deep cleaning, protection, eco-friendly, efficiency), and booking CTA.",
  "frontend/src/components/ServiceAreasSection.tsx": "Displays a grid of 12 Ahmedabad service areas with FaMapMarkerAlt icons in orange, using glass-card styling and capsule borders.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication using Internet Identity, with automatic query invalidation when the actor changes.",
  "frontend/src/hooks/useIconSound.ts": "React hook that manages icon click sound effects with localStorage persistence for user preference, providing play, toggle, and enabled state functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/i18n/LanguageProvider.tsx": "React context provider for multi-language support (English, Hindi, Gujarati) with localStorage persistence and document language attribute management.",
  "frontend/src/i18n/translations.ts": "TypeScript definitions and translation data for three languages (en, hi, gu) covering all UI sections including navigation, hero, services, booking, and footer content.",
  "frontend/src/i18n/useTranslation.ts": "Simple wrapper hook that exposes the LanguageContext for accessing translations and language switching functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, glassmorphism effects, and brand colors using OKLCH color space with extensive animation and component utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom theme extensions including multi-language font families, OKLCH color system, glassmorphism utilities, and extensive animation keyframes for hero and UI effects.",
  "project_state.json": "Project state tracking file for a web application redesign to match a reference site at magical-sofa-cleaning-d8q.caffeine.xyz. Includes four existing features for updating color scheme, icons, layout, and visual effects, plus one pending feature request."
}