{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting two features related to fixing blank page issues and ensuring asset loading, both linked to frontend/index.html with high confidence.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend component files, describing their styling (glassmorphism, Font Awesome icons), functionality, and design patterns.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system variables for light and dark themes, including custom CSS properties for borders, backgrounds, and component styling.",
  "frontend/index.html": "HTML entry point with SEO meta tags, structured JSON-LD data for local business, Google Fonts for multilingual support (Gujarati/Hindi), and noscript fallback.",
  "frontend/src/App.tsx": "Root React component that renders the LandingPage component.",
  "frontend/src/components/landing/BookingSection.tsx": "Booking form component with name, service type, and area inputs that submits data via WhatsApp link, featuring glass-panel styling and a custom green button with shine animation.",
  "frontend/src/components/landing/CoverageSection.tsx": "Coverage information section with Font Awesome icons, glass-panel styling, and SEO-focused text describing service areas.",
  "frontend/src/components/landing/FloatingWhatsAppButton.tsx": "Fixed-position floating WhatsApp button with pill-shaped styling, accessibility attributes, and translated labels.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section component with animated background image, multi-layer gradient overlays, floating decorative blobs, and glass-styled content panel containing title, tagline, and CTA buttons for WhatsApp and phone contact.",
  "frontend/src/components/landing/IconBadge.tsx": "Reusable icon badge component with configurable size, variant (primary/orange), and optional sound effects on click, featuring gradient backgrounds and hover animations.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer component displaying brand logo, service van icon, CTA buttons for phone and WhatsApp, copyright notice, and attribution link to caffeine.ai with UTM tracking.",
  "frontend/src/components/landing/LandingNav.tsx": "Sticky navigation bar with brand logo, language selector (English/Hindi/Gujarati), and 'Book Now' button that smoothly scrolls to the booking section.",
  "frontend/src/components/landing/LandingPage.tsx": "Main landing page component that assembles all sections including navigation, hero, services, coverage, booking, footer, and floating WhatsApp button into a complete page layout.",
  "frontend/src/components/landing/LocalSeoPhrasesSection.tsx": "SEO-focused section displaying four local service phrases in a grid layout with icons, plus a footer text block for additional local search optimization.",
  "frontend/src/components/landing/OurWorkSection.tsx": "Portfolio gallery section displaying six work images in a responsive grid with hover effects, showcasing AC cleaning services, before/after shots, and service team photos.",
  "frontend/src/components/landing/ServicesSection.tsx": "Services overview section presenting four core services (water jet, water jet foam, repairing, installation) in a responsive grid with icons and descriptions.",
  "frontend/src/components/landing/SofaCleaningSection.tsx": "Dedicated section for sofa and upholstery cleaning services, featuring service list, pricing, four feature highlights with orange-themed icons, and promotional discount text.",
  "frontend/src/components/landing/WaterJetFoamSection.tsx": "Two-column section highlighting water jet foam service with product image, detailed description, four benefit cards (deep cleaning, protection, eco-friendly, efficiency), and CTA button.",
  "frontend/src/components/ServiceAreasSection.tsx": "Service areas section displaying coverage locations in a grid layout with Font Awesome map marker icons and glassmorphism card styling.",
  "frontend/src/hooks/useActor.ts": "React hook that manages an authenticated or anonymous actor for backend communication using Internet Identity, with automatic query invalidation when the actor changes.",
  "frontend/src/hooks/useIconSound.ts": "React hook that manages icon click sound effects with volume control, localStorage persistence for user preference, and graceful error handling for audio playback.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/i18n/LanguageProvider.tsx": "React context provider for multi-language support (English, Hindi, Gujarati) with localStorage persistence and document language attribute updates.",
  "frontend/src/i18n/translations.ts": "TypeScript definitions and translation objects for three languages (en, hi, gu) covering all UI sections including navigation, hero, services, booking, and footer content.",
  "frontend/src/i18n/useTranslation.ts": "Simple hook wrapper that exposes the language context for accessing translations and language switching functionality.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, glassmorphism effects, brand colors (teal/cyan water jet theme), and animation utilities with reduced-motion support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for multi-language fonts (Gujarati, Devanagari), OKLCH color system, glassmorphism shadows, and custom animations for hero and UI elements.",
  "project_state.json": "Project metadata tracking the Water Jet Service website's features, known issues (blank page bug), architectural notes about multi-language support and SEO optimization for Ahmedabad locations."
}