{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing blank page issues, verifying static asset loading, and ensuring correct HTML entry point configuration.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend components, describing glassmorphism styling, Font Awesome icon usage, multilingual support, and landing page sections.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system variables for light and dark themes, defining design tokens for backgrounds, foregrounds, borders, and component colors.",
  "frontend/index.html": "HTML entry point with SEO meta tags, structured data for local business schema, Google Fonts for multilingual support (Gujarati/Hindi), and noscript fallback messaging.",
  "frontend/src/App.tsx": "Root React component that wraps LandingPage with LanguageProvider to enable internationalization throughout the application.",
  "frontend/src/components/landing/BookingSection.tsx": "Booking form component with name, service type, and area inputs that generates a WhatsApp message template and opens WhatsApp with pre-filled booking details.",
  "frontend/src/components/landing/CoverageSection.tsx": "Coverage information section with glassmorphism panel styling, displaying service area description and SEO-optimized location text with Font Awesome icons.",
  "frontend/src/components/landing/FloatingWhatsAppButton.tsx": "Fixed-position floating WhatsApp button with glassmorphism styling, accessibility attributes, and translated label linking to WhatsApp contact.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section component with animated background image, gradient overlays, floating decorative blobs, and glass-panel styled content featuring title, tagline, and CTA buttons for WhatsApp and phone contact.",
  "frontend/src/components/landing/IconBadge.tsx": "Reusable icon badge component with configurable size, variant (primary/orange), and optional sound effects on click, featuring gradient backgrounds and hover animations.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer component displaying brand logo, service van icon, CTA buttons for phone and WhatsApp, copyright notice, and attribution link to caffeine.ai.",
  "frontend/src/components/landing/LandingNav.tsx": "Sticky navigation bar with logo, brand name, language selector (English/Hindi/Gujarati), and a 'Book Now' button that smoothly scrolls to the booking section.",
  "frontend/src/components/landing/LandingPage.tsx": "Main landing page component that assembles all sections including navigation, hero, services, coverage, booking, footer, and floating WhatsApp button with gradient background.",
  "frontend/src/components/landing/LocalSeoPhrasesSection.tsx": "SEO-focused section displaying four local service phrases in a grid layout with icons, designed to improve local search visibility for AC services in Ahmedabad.",
  "frontend/src/components/landing/OurWorkSection.tsx": "Gallery section showcasing six work images (water jet cleaning, before/after, service team, van) in a responsive grid with hover effects and error handling for missing images.",
  "frontend/src/components/landing/ServicesSection.tsx": "Services overview section displaying four core AC services (water jet, water jet foam, repairing, installation) in a responsive grid with icons and descriptions.",
  "frontend/src/components/landing/SofaCleaningSection.tsx": "Dedicated section for sofa and upholstery cleaning services featuring service list, pricing, four feature badges with icons, and promotional discount text with CTA button.",
  "frontend/src/components/landing/WaterJetFoamSection.tsx": "React component displaying a two-column section showcasing water jet foam cleaning service with an image, heading, description, four benefit cards (deep cleaning, protection, eco-friendly, efficiency), and a CTA button. Uses internationalization and glassmorphism styling.",
  "frontend/src/components/ServiceAreasSection.tsx": "Service areas section displaying coverage locations in a three-column grid with Font Awesome map marker icons and glassmorphism card styling.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useIconSound.ts": "Custom React hook that manages icon click sound effects with localStorage persistence, providing playSound, toggleSound functions and isSoundEnabled state with a 0.3 volume audio element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options for idle behavior and derivation origin.",
  "frontend/src/i18n/LanguageProvider.tsx": "React context provider managing language state (en/hi/gu) with localStorage persistence, document language attribute updates, and providing translations through context to child components.",
  "frontend/src/i18n/translations.ts": "TypeScript definitions and translation data for three languages (English, Hindi, Gujarati) covering all UI sections including navigation, hero, services, booking, footer, and SEO content for an AC/water jet service business.",
  "frontend/src/i18n/useTranslation.ts": "Simple wrapper hook that re-exports the useLanguageContext hook for accessing translation functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining a modern water jet brand color scheme (teal/cyan/blue), glassmorphism utilities, and reduced motion support for animations.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom font families (Inter, Gujarati, Devanagari), container settings, border radius variables, and custom shadows. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking a blank page issue in Draft Version 27, with existing features focused on diagnosing asset loading, HTML entry point configuration, and a pending feature request to check for JavaScript initialization errors."
}