{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report mapping landing‑page styling and text‑translation updates to affected React files.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend React components and configuration files.",
  "frontend/index.css": "Global Tailwind base styles and OKLCH variable definitions for light/dark themes.",
  "frontend/index.html": "HTML entry point with metadata and script mounting the React app.",
  "frontend/src/App.tsx": "Root component that renders the LandingPage.",
  "frontend/src/components/landing/BookingSection.tsx": "Booking form that validates inputs and opens a WhatsApp prefilled message.",
  "frontend/src/components/landing/CoverageSection.tsx": "Displays high‑level coverage text for Ahmedabad and Gandhinagar.",
  "frontend/src/components/landing/FloatingWhatsAppButton.tsx": "Floating WhatsApp quick‑action button fixed at screen bottom‑right.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero block with blue gradient background, tagline, and WhatsApp/Call CTAs.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer with branding, contact shortcuts, copyright, and attribution.",
  "frontend/src/components/landing/LandingNav.tsx": "Sticky white nav bar with branded title and smooth‑scroll Book Now button.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes all landing sections into a full page layout.",
  "frontend/src/components/landing/OurWorkSection.tsx": "Gallery showing two AC cleaning examples with images and captions.",
  "frontend/src/components/landing/ServicesSection.tsx": "Grid of four AC service cards with icons and English descriptions.",
  "frontend/src/components/ServiceAreasSection.tsx": "Lists service areas in three bordered cards with an English footnote.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider and hook for managing identities, login flow, and AuthClient configuration.",
  "frontend/src/index.css": "Defines Tailwind base layers and extensive CSS variables for light/dark themes, layout, and custom color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and components using CSS variables and plugin integrations.",
  "project_state.json": "Project metadata summarizing features, versions, and implemented components for the marketing website and ICP setup."
}