{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence listing three updates to ServicesSection.tsx including layout, English text, and icon replacements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend React components and config files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode overrides, and global styles.",
  "frontend/index.html": "HTML entry file configuring root div, metadata, favicon, and loading main React script.",
  "frontend/src/App.tsx": "Renders the LandingPage component as the root app output.",
  "frontend/src/components/landing/BookingSection.tsx": "Booking form that validates inputs and opens a prefilled WhatsApp message on submit.",
  "frontend/src/components/landing/CoverageSection.tsx": "Displays service coverage message with listed areas in Ahmedabad and Gandhinagar.",
  "frontend/src/components/landing/FloatingWhatsAppButton.tsx": "Floating WhatsApp button linking to chat with styling and hover effects.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero banner with background image, title, tagline, and WhatsApp/Call CTAs.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer with branding, contact buttons, copyright, and caffeine.ai attribution.",
  "frontend/src/components/landing/LandingNav.tsx": "Sticky navigation bar with brand title, call button, and smooth-scroll Book Now link.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes all landing page sections into a full-page layout.",
  "frontend/src/components/landing/OurWorkSection.tsx": "Shows two AC cleaning gallery items with images and captions in a responsive grid.",
  "frontend/src/components/landing/ServicesSection.tsx": "Four-card services grid using lucide-react icons, blue-accent styling, and short English descriptions.",
  "frontend/src/components/ServiceAreasSection.tsx": "Renders four service area cards in a blue-tinted grid with bilingual labels.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context/provider and hook for managing Internet Identity login, identity restoration, and AuthClient lifecycle.",
  "frontend/src/index.css": "Tailwind base styles with extensive OKLCH CSS variables for light/dark themes and service-area colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Metadata file describing project state, features, and versioning for an ICP dapp with React frontend and Motoko backend."
}