{
  "kind": "build_request",
  "title": "Simplify landing page: remove Our Work and make content text-only; update service areas list",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the “Our Work” section from the landing page so it is no longer displayed anywhere.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Please remove the 'Our Work' section and all service images."
        ]
      },
      "acceptanceCriteria": [
        "Landing page no longer renders the Our Work/gallery section",
        "There are no remaining navigation/scroll targets or headings referencing “Our Work”"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove all service images and decorative iconography so the website is simple and text-based (e.g., remove any gallery images, remove service-card icons, and remove location-pin emojis/icons in the service areas list; keep CTAs as text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Please remove the 'Our Work' section and all service images.",
          "Keep the website simple and text-based."
        ]
      },
      "acceptanceCriteria": [
        "No <img> elements remain in any service-related sections (including any gallery/work examples)",
        "Services section displays titles/descriptions without icons",
        "Service Areas section displays plain text area names without emoji/icon prefixes",
        "Hero/CTA buttons/links render without decorative icons (text-only CTAs remain functional)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Service Areas section to list exactly these locations (and no others): Hanspura, Shahibaug, New Shahibaug, Nana Chiloda, Nikol, Naroda, Bapunagar, Odhav, Satellite, Prahladnagar, Bopal, Gota, Science City, and Gandhinagar (All Sectors).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Update the service areas to include: Hanspura, Shahibaug, New Shahibaug, Nana Chiloda, Nikol, Naroda, Bapunagar, Odhav, Satellite, Prahladnagar, Bopal, Gota, Science City, and Gandhinagar (All Sectors)."
        ]
      },
      "acceptanceCriteria": [
        "Service Areas section contains only the specified areas and removes previously listed areas not in the user’s list",
        "User-facing text remains in English",
        "“Gandhinagar (All Sectors)” appears exactly as written"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update any coverage/summary text that enumerates service locations (e.g., the coverage section paragraph) to align with the updated Service Areas list and to avoid mentioning removed locations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Update the service areas to include: Hanspura, Shahibaug, New Shahibaug, Nana Chiloda, Nikol, Naroda, Bapunagar, Odhav, Satellite, Prahladnagar, Bopal, Gota, Science City, and Gandhinagar (All Sectors)."
        ]
      },
      "acceptanceCriteria": [
        "Coverage/summary section does not mention any locations that are not in the new Service Areas list",
        "Coverage/summary section still clearly states service availability in Ahmedabad and Gandhinagar (All Sectors)"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend.immutablePaths (compose existing hooks/components instead of editing them).",
    "Keep changes limited to simplifying the landing page and updating the service-area content; no backend changes."
  ],
  "nonGoals": [
    "Adding new landing page sections or new media/image galleries",
    "Introducing new authentication flows or backend data models",
    "Adding external integrations or third-party APIs"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}