{
  "kind": "build_request",
  "title": "Apply provided HTML landing design and translate remaining Gujarati text to English",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the React landing page styling to match the provided HTML snippet’s look and feel for the top navigation and hero section: keep the sticky white nav with a bold/underlined/italic brand title and an orange “Book Now” button, and update the hero section to use a blue diagonal gradient background (linear-gradient 135deg from #1e3a8a to #3b82f6) with centered heading and CTA buttons for WhatsApp and phone.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "<nav class=\"bg-white shadow-lg p-4 sticky top-0 z-50\">",
          ".hero-gradient { background: linear-gradient(135deg, #1e3a8a 0%, #3b82f6 100%); }",
          "<a href=\"#book\" class=\"bg-orange-500 text-white px-5 py-2 rounded-lg font-bold shadow-md hover:bg-orange-600 transition\">Book Now</a>"
        ]
      },
      "acceptanceCriteria": [
        "Landing navigation remains sticky and visually matches the provided snippet (white background, shadow, underlined/italic brand, orange Book Now button).",
        "Hero section uses the specified blue diagonal gradient background (not an image background).",
        "Hero CTA buttons continue to link to WhatsApp (wa.me) and phone (tel:) using the existing number 8000262644."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace all remaining Gujarati user-facing text in the landing page sections with clear English equivalents while keeping the meaning (at minimum: Services section heading and service descriptions; ensure the hero tagline is English).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request.",
          "<p class=\"text-xl md:text-2xl mb-8 text-blue-100 font-medium\">અમદાવાદમાં સૌથી ફાસ્ટ અને વિશ્વાસપાત્ર એસી સર્વિસ</p>",
          "<h2 class=\"text-3xl font-bold text-center mb-12 text-gray-800 underline underline-offset-8 decoration-blue-500\">અમારી સેવાઓ</h2>"
        ]
      },
      "acceptanceCriteria": [
        "No Gujarati text remains visible anywhere in the rendered landing page UI.",
        "Services section content is fully in English (section title + each service description).",
        "Hero tagline is English and communicates the same meaning as the Gujarati line (fast + trusted AC service in Ahmedabad)."
      ]
    }
  ],
  "constraints": [
    "Do not add external CDN dependencies (e.g., Tailwind CDN or Font Awesome CDN); use the existing Tailwind setup and existing icon libraries already in the project.",
    "Do not modify files under frontend/src/components/ui (read-only shadcn/ui sources)."
  ],
  "nonGoals": [
    "Fixing ICP deployment/build pipeline errors (not requested with actionable details).",
    "Adding new backend features or persistence; keep this as a marketing/landing UI change only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}