{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 'Our Work' gallery section to landing page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new landing-page Our Work gallery section component and wire it into LandingPage between ServicesSection and CoverageSection.",
      "acceptanceCriteria": [
        "A new React component exists under the existing landing components folder (frontend/src/components/landing/...) for the gallery section.",
        "LandingPage includes the new gallery section after ServicesSection and before CoverageSection.",
        "No changes are made to files under frontend/src/components/ui or other immutable paths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/OurWorkSection.tsx",
          "operation": "create",
          "description": "Create a new landing section component that will render the Our Work gallery content (static, frontend-only)."
        },
        {
          "path": "frontend/src/components/landing/LandingPage.tsx",
          "operation": "modify",
          "description": "Import and render OurWorkSection after ServicesSection and before CoverageSection to match the required landing page flow."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement the Our Work gallery UI with English heading/subtitle and responsive image card grid with hover animations.",
      "acceptanceCriteria": [
        "The section displays a heading \"Our Work\" and a subtitle \"Professional indoor and outdoor AC cleaning\" (or equivalent English phrasing).",
        "The gallery grid is responsive with breakpoints equivalent to grid-cols-1 / sm:grid-cols-2 / lg:grid-cols-3.",
        "Each card includes an image, an English title, and (if included) a short English caption; images have meaningful alt text.",
        "Hovering a card increases its shadow and slightly scales the image (no layout shift)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/OurWorkSection.tsx",
          "operation": "modify",
          "description": "Implement section heading/subtitle and a responsive Tailwind grid of image cards with rounded corners, subtle border/shadow, overflow-hidden image container, and hover interactions (card shadow increase + image scale) without layout shift."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Seed the Our Work gallery with at least three static items including the provided Unsplash URL and consistent image cropping.",
      "acceptanceCriteria": [
        "At least 3 gallery items render by default.",
        "One item uses the exact provided image URL.",
        "All images display with consistent dimensions/cropping (e.g., same height and object-cover)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/OurWorkSection.tsx",
          "operation": "modify",
          "description": "Add a static in-component data list with at least 3 gallery items, ensuring one uses the exact Unsplash URL (https://images.unsplash.com/photo-1621905235850-66c430939502?auto=format&fit=crop&w=600&h=400&q=80), and render images with consistent fixed height and object-cover cropping."
        }
      ]
    }
  ]
}