{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify landing page to text-only and update Service Areas",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the Our Work section so it is no longer displayed anywhere on the landing page.",
      "acceptanceCriteria": [
        "Landing page no longer renders the Our Work/gallery section",
        "There are no remaining navigation/scroll targets or headings referencing “Our Work”"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/LandingPage.tsx",
          "operation": "modify",
          "description": "Remove the OurWorkSection import and remove its render from the landing page composition so it cannot appear anywhere in the landing flow."
        },
        {
          "path": "frontend/src/components/landing/OurWorkSection.tsx",
          "operation": "delete",
          "description": "Delete the OurWorkSection implementation to ensure the gallery section (and its heading/scroll references) cannot be reintroduced or displayed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove service images and decorative iconography to make service-related UI fully text-based while keeping CTAs functional.",
      "acceptanceCriteria": [
        "No <img> elements remain in any service-related sections (including any gallery/work examples)",
        "Services section displays titles/descriptions without icons",
        "Service Areas section displays plain text area names without emoji/icon prefixes",
        "Hero/CTA buttons/links render without decorative icons (text-only CTAs remain functional)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/ServicesSection.tsx",
          "operation": "modify",
          "description": "Remove lucide-react icon imports and update the services data/rendering so cards show only service title and description (no icon components)."
        },
        {
          "path": "frontend/src/components/landing/HeroSection.tsx",
          "operation": "modify",
          "description": "Remove decorative CTA icons (WhatsApp/Phone) and adjust CTA link content/styling so CTAs remain text-only and functional."
        },
        {
          "path": "frontend/src/components/landing/FloatingWhatsAppButton.tsx",
          "operation": "modify",
          "description": "Replace the icon-only floating WhatsApp control with a text-only control (no decorative iconography) while keeping the WhatsApp link behavior unchanged."
        },
        {
          "path": "frontend/src/components/landing/LandingFooter.tsx",
          "operation": "modify",
          "description": "Remove decorative icons from footer call/WhatsApp shortcuts and any other iconography so footer actions are text-only links while preserving functionality."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update Service Areas to list exactly the specified locations and remove all other locations and any icon/emoji prefixes.",
      "acceptanceCriteria": [
        "Service Areas section contains only the specified areas and removes previously listed areas not in the user’s list",
        "User-facing text remains in English",
        "“Gandhinagar (All Sectors)” appears exactly as written"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ServiceAreasSection.tsx",
          "operation": "modify",
          "description": "Replace the existing area groups with a plain-text list containing exactly: Hanspura, Shahibaug, New Shahibaug, Nana Chiloda, Nikol, Naroda, Bapunagar, Odhav, Satellite, Prahladnagar, Bopal, Gota, Science City, and Gandhinagar (All Sectors); remove any 📍 or other icon/emoji prefixes and remove any extra locations."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Align coverage/summary text that enumerates locations with the updated Service Areas list and avoid mentioning removed locations.",
      "acceptanceCriteria": [
        "Coverage/summary section does not mention any locations that are not in the new Service Areas list",
        "Coverage/summary section still clearly states service availability in Ahmedabad and Gandhinagar (All Sectors)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/CoverageSection.tsx",
          "operation": "modify",
          "description": "Update the coverage paragraph to reference only locations from the updated Service Areas list and ensure it clearly states availability across Ahmedabad and Gandhinagar (All Sectors) without mentioning removed areas."
        }
      ]
    }
  ]
}