{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Landing page design alignment and English translation cleanup",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Match the provided HTML look-and-feel for the sticky top navigation and hero section, including the specified gradient hero background and CTA links.",
      "acceptanceCriteria": [
        "Landing navigation remains sticky and visually matches the provided snippet (white background, shadow, underlined/italic brand, orange Book Now button).",
        "Hero section uses the specified blue diagonal gradient background (not an image background).",
        "Hero CTA buttons continue to link to WhatsApp (wa.me) and phone (tel:) using the existing number 8000262644."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/LandingNav.tsx",
          "operation": "modify",
          "description": "Adjust nav layout and Tailwind classes to align with the provided HTML snippet: keep sticky white nav + shadow, ensure brand styling remains bold/underlined/italic, and update the “Book Now” button styling to match the orange button/hover behavior from the snippet. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/landing/HeroSection.tsx",
          "operation": "modify",
          "description": "Replace the current background-image/overlay hero styling with the required blue diagonal gradient background (linear-gradient 135deg from #1e3a8a to #3b82f6), keep centered heading and CTA buttons, and ensure WhatsApp (wa.me) and phone (tel:) links continue using 8000262644. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Translate all remaining Gujarati user-facing text in landing page sections to clear English equivalents while preserving meaning.",
      "acceptanceCriteria": [
        "No Gujarati text remains visible anywhere in the rendered landing page UI.",
        "Services section content is fully in English (section title + each service description).",
        "Hero tagline is English and communicates the same meaning as the Gujarati line (fast + trusted AC service in Ahmedabad)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/ServicesSection.tsx",
          "operation": "modify",
          "description": "Translate the Services section heading and all service descriptions from Gujarati to clear English while keeping the original meaning; ensure no Gujarati text remains in this section after updates. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/landing/HeroSection.tsx",
          "operation": "modify",
          "description": "Confirm the hero tagline and any other user-facing hero text remains fully English and matches the intended meaning (fast + trusted AC service in Ahmedabad), with no Gujarati visible. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}