{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Services section 4-card layout + English copy + icon update (no Font Awesome)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restyle the landing Services section to match the provided 4-card grid layout (white section, centered underlined heading, light-blue cards with rounded corners, bottom accent border, and shadow).",
      "acceptanceCriteria": [
        "Services section background is white and uses similar vertical spacing to the provided snippet.",
        "Section heading is centered, underlined, and uses an English heading (not Gujarati) while preserving the same visual emphasis (underline + offset).",
        "Cards render in a responsive 1/2/4-column grid with consistent spacing.",
        "Each card uses: padding, light-blue background, rounded-2xl corners, a bottom border accent (border-b-4), and a visible shadow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/ServicesSection.tsx",
          "operation": "modify",
          "description": "Update section container styling to use a white background and the provided vertical spacing; update the section heading styling to be centered and underlined with underline offset; update card container styles to match the provided light-blue background, rounded-2xl corners, border-b-4 bottom accent, and shadow-md while preserving the existing responsive 1/2/4-column grid."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure all user-facing Services section text is English, with titles exactly matching the requested four services and Gujarati descriptions translated to English equivalents.",
      "acceptanceCriteria": [
        "No Gujarati text is displayed in the Services section after the update.",
        "The four service titles appear exactly as: Jet Wash Service, Expert Repairing, Gas Refilling, Installation.",
        "Each card contains an English description corresponding to the original Gujarati sentence meaning (deep cleaning indoor/outdoor; precise PCB/compressor work; original gas for full cooling; safe fitting for new/old AC)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/ServicesSection.tsx",
          "operation": "modify",
          "description": "Update the services data to ensure titles exactly match: Jet Wash Service, Expert Repairing, Gas Refilling, Installation; replace any existing non-matching titles (e.g., 'Repairing') and update descriptions to English translations reflecting the original Gujarati meanings (indoor/outdoor deep cleaning; precise PCB/compressor work; original gas for full cooling; safe fitting for new/old AC)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace/confirm the Services section icon implementation to avoid any Font Awesome dependency while still showing the intended four icons with similar size and blue color.",
      "acceptanceCriteria": [
        "Each of the four service cards shows an icon above the title with approximately the same visual prominence as text-4xl.",
        "Icons are blue and aligned/centered consistently across cards.",
        "No new Font Awesome stylesheet/script dependency is introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/ServicesSection.tsx",
          "operation": "modify",
          "description": "Ensure the four service icons are rendered using the existing non-Font-Awesome approach (e.g., lucide-react) for snowflake, tools, gas pump, and box/open package; size and style the icons to match the provided prominence (approx. text-4xl) and blue color, centered above each title, without adding any Font Awesome dependency."
        }
      ]
    }
  ]
}